[
  {
    "position": "Senior Software Engineer",
    "include": true,
    "company": "Square (Block)",
    "location": "San Francisco, CA (Remote)",
    "start": "April 2025",
    "end": "March 2026",
    "description": [
      "Designed and launched an end-to-end inactive account processing pipeline to meet regulatory requirements, covering identification (Snowflake), merchant notification, automated closure, feature-flagged rollout, and monitoring.",
      "Led a zero-downtime migration off a legacy onboarding service using shadow traffic and structured mismatch logging, enabling safe cutover and full deprecation of legacy dependencies."
    ],
    "languages": [
      "Ruby (Rails)",
      "Java",
      "Kotlin",
      "MySQL"
    ]
  },
  {
    "position": "Software Engineer",
    "include": true,
    "company": "Square (Block)",
    "location": "San Francisco, CA (Remote)",
    "start": "December 2022",
    "end": "April 2025",
    "description": [
      "Implemented Japan issuer installments end-to-end, unlocking a critical payment method for Japanese market expansion and increasing checkout conversion through installment pricing display across PDP/cart/order flow.",
      "Contributed to checkout redesign for Square's hardware e-commerce platform serving multiple international markets, implementing modern React patterns, promo management, and responsive layouts across Rails + React stack.",
      "Migrated application from in-house feature flag application to vendor application.",
      "Added trade-in flow for sellers with deprecated devices contributing to the effort to ensure sellers had access to latest hardware and software."
    ],
    "languages": [
      "Ruby (Rails)",
      "Javascript (React)",
      "MySQL"
    ]
  },
  {
    "position": "Backend Web Engineer",
    "include": true,
    "company": "Linden Lab",
    "location": "San Francisco, CA (Remote)",
    "start": "November 2018",
    "end": "December 2022",
    "description": [
      "Implemented new features to allow users to self-service and reduce support load. They include account reactivation and partial payments.",
      "Part of the effort to update our billing application to accommodate new payment service providers.",
      "Led effort to migrate transactional emails to 3rd party service and update them from plaintext to HTML localized layouts.",
      "Updated our team's web applications to record analytics metrics.",
      "Contributed to the company's effort to Dockerize our team's multi-faceted web applications and migrate them to the AWS cloud.",
      "Developed internal APIs leveraged by both our web applications and our Viewer desktop application related to MFA."
    ],
    "languages": [
      "Python (Django)",
      "PHP",
      "Javascript",
      "Ruby (Rails)",
      "Perl",
      "MySQL",
      "Docker",
      "AWS"
    ]
  },
  {
    "position": "Web Developer",
    "include": true,
    "company": "Brighton Collectibles",
    "location": "City of Industry, CA",
    "start": "July 2016",
    "end": "November 2018",
    "description": [
      "Wrote document management system for document distribution to stores.",
      "Designed and implemented media distribution application to enable Marketing to share social and printable media with partners.",
      "Developed and maintained RESTful APIs that were critical to customer-facing and internal business applications.",
      "Developed scripts for the sanitation and import of data into company databases as well as the processes to monitor them.",
      "Contributed to the planning and design of database schema to ensure normalized data with flexibility to grow."
    ],
    "languages": [
      "PHP",
      "Javascript (Vue.js)",
      "MySQL"
    ]
  },
  {
    "position": "NOC Technician & Developer",
    "include": true,
    "company": "Forever 21",
    "location": "Los Angeles, CA",
    "start": "February 2015",
    "end": "July 2016",
    "description": [
      "Developed NOC monitoring dashboard and backend to support applications.",
      "Wrote server scripts that integrated 3rd party services into central monitoring.",
      "Designed system for report generation of team performance metrics.",
      "Administered Jira company-wide and implemented departments' project requirements."
    ],
    "languages": [
      "C",
      "Python",
      "PHP",
      "Javascript",
      "MySQL"
    ]
  },
  {
    "position": "IT Technician",
    "include": true,
    "company": "Forever 21",
    "location": "Los Angeles, CA",
    "start": "September 2014",
    "end": "February 2015",
    "description": [
      "Remedied company-wide payment system outage by writing hotfix script deployed to 1000+ store servers in 500+ locations.",
      "Wrote Windows application for Store Support team that partially automated ticket creation."
    ],
    "languages": [
      "Batch",
      "AutoIt"
    ]
  },
  {
    "position": "Teller",
    "include": false,
    "company": "Citibank, N.A.",
    "location": "Los Angeles, CA",
    "start": "June 2013",
    "end": "September 2014",
    "description": [
      "Exceeded customer service expectations based on customer service satisfaction surveys.",
      "Lead the implementation of the new inventory management procedures."
    ]
  },
  {
    "position": "Desktop Technician",
    "include": false,
    "company": "Direct Wireless",
    "location": "Los Angeles, CA",
    "start": "December 2010",
    "end": "June 2013",
    "description": [
      "Sole technician and responsible for computer and phone repair/diagnostic.",
      "Maintained in-store computers (internet-cafe) and implemented own system management method to reduce maintenance requirement."
    ]
  }
]
